src/cfe/InformationRegisters/OData4_ПовторыЗапросов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>OData4_ПовторыЗапросов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Отпечаток</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Метод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Путь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Заголовки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Тело</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Записан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Срок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Субъект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/CommonModules/OData4_ПовторыЗапросов/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Повторяемые запросы записи (отзыв безопасности, группа B): заголовок Repeatability-Request-ID (OData 4.01, вместе
// с Repeatability-Client-ID и Repeatability-First-Sent) или Idempotency-Key. Запрос с ключом выполняется в одной
// транзакции с записью его ответа в регистр OData4_ПовторыЗапросов (OData4_Запись.ВыполнитьСПовтором): ключ записи —
// субъект запроса и SHA-256 имени заголовка, клиента и значения ключа. Повтор с тем же ключом того же субъекта ждёт
// блокировку ключа (пока первый выполняется) и получает сохранённый ответ без повторного выполнения; тот же ключ с
// другим запросом (метод, путь, параметры, тело) — 422. Ответ с ошибкой не хранится: запись откатилась, повтор
// выполняется заново. Срок хранения — настройка СрокПовторовЗапросов (часы, по умолчанию 24); просроченные записи
// удаляет регламентное задание OData4_Очистка. Заголовок для клиента необязателен.

// Описание повтора запроса записи (Запрос — описание OData4_Запись.ОписаниеЗапроса или операция $batch):
// Структура «Заголовок, Субъект, Ключ, Отпечаток, Метод, Путь, Часов» или Неопределено (заголовка нет). Неверное
// значение заголовка — 400; Repeatability-First-Sent старше срока хранения — 400 (повтор не распознать).
Функция ОписаниеПовтора(Запрос) Экспорт
	Заголовок = "Repeatability-Request-ID";
	Ид = СокрЛП(OData4_Безопасность.ЗначениеЗаголовка(Запрос, Заголовок));
	Если Ид = "" Тогда
		Заголовок = "Idempotency-Key";
		Ид = СокрЛП(OData4_Безопасность.ЗначениеЗаголовка(Запрос, Заголовок));
	КонецЕсли;
	Если Ид = "" Тогда
		Возврат Неопределено;
	КонецЕсли;
	Если СтрДлина(Ид) > 200 Тогда
		Отказ(Заголовок, 400, "BadRequest", "Заголовок " + Заголовок + " длиннее 200 символов");
	КонецЕсли;
	Часов = СрокЧасов();
	Клиент = "";
	Если Заголовок = "Repeatability-Request-ID" Тогда
		Клиент = СокрЛП(OData4_Безопасность.ЗначениеЗаголовка(Запрос, "Repeatability-Client-ID"));
		ПервыйРаз = СокрЛП(OData4_Безопасность.ЗначениеЗаголовка(Запрос, "Repeatability-First-Sent"));
		Если ПервыйРаз <> "" Тогда
			Момент = ДатаHTTP(ПервыйРаз);
			Если Момент = Неопределено Тогда
				Отказ(Заголовок, 400, "BadRequest", "Неверный заголовок Repeatability-First-Sent: " + ПервыйРаз);
			ИначеЕсли Момент < ТекущаяУниверсальнаяДата() - Часов * 3600 Тогда
				Отказ(Заголовок, 400, "BadRequest", "Repeatability-First-Sent старше срока хранения ответов ("
					+ Формат(Часов, "ЧГ=0") + " ч): повтор не распознать");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Метод = ВРег(Запрос.HTTPМетод);
	Результат = Новый Структура("Заголовок, Субъект, Ключ, Отпечаток, Метод, Путь, Часов");
	Результат.Заголовок = Заголовок;
	Результат.Субъект = Лев(OData4_БезопасностьВызов.Контекст().Субъект, 200);
	Результат.Ключ = Хеш(Заголовок + Символы.ПС + Клиент + Символы.ПС + Ид);
	Результат.Метод = Лев(Метод, 10);
	Результат.Путь = Лев(Запрос.ОтносительныйURL, 1024);
	Результат.Отпечаток = Хеш(Метод + Символы.ПС + Запрос.ОтносительныйURL + Символы.ПС
		+ OData4_Безопасность.КаноническиеПараметры(Запрос.ПараметрыЗапроса) + Символы.ПС
		+ ?(Запрос.Тело = Неопределено, "", Запрос.Тело));
	Результат.Часов = Часов;
	Возврат Результат;
КонецФункции

// Начало выполнения повторяемого запроса (в транзакции вызывающего): исключительная блокировка ключа и сохранённый
// ответ — Структура «Статус, Заголовки, Тело» — или Неопределено (запрос с этим ключом ещё не выполнялся или срок
// хранения его ответа истёк). Блокировку держит выполняющийся запрос с тем же ключом дольше тайм-аута — 409; ключ
// уже использован для другого запроса — 422.
Функция Начать(Повтор) Экспорт
	Блокировка = Новый БлокировкаДанных;
	Элемент = Блокировка.Добавить("РегистрСведений.OData4_ПовторыЗапросов");
	Элемент.Режим = РежимБлокировкиДанных.Исключительный;
	Элемент.УстановитьЗначение("Субъект", Повтор.Субъект);
	Элемент.УстановитьЗначение("Ключ", Повтор.Ключ);
	Попытка
		Блокировка.Заблокировать();
	Исключение
		ЗаписьЖурналаРегистрации("OData4.Запись", УровеньЖурналаРегистрации.Предупреждение, , ,
			"Ключ повторения занят: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Отказ(Повтор.Заголовок, 409, "Conflict", "Запрос с этим значением " + Повтор.Заголовок + " ещё выполняется");
	КонецПопытки;
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	П.Отпечаток КАК Отпечаток,
		|	П.Статус КАК Статус,
		|	П.Заголовки КАК Заголовки,
		|	П.Тело КАК Тело,
		|	П.Срок КАК Срок
		|ИЗ
		|	РегистрСведений.OData4_ПовторыЗапросов КАК П
		|ГДЕ
		|	П.Субъект = &Субъект
		|	И П.Ключ = &Ключ");
	Запрос.УстановитьПараметр("Субъект", Повтор.Субъект);
	Запрос.УстановитьПараметр("Ключ", Повтор.Ключ);
	// Регистр читается и пишется в привилегированном режиме, если он доступен (в безопасном режиме расширения — правами
	// ролей расширения); режим снимается в той же процедуре, где установлен (требование платформы).
	Был = ПривилегированныйРежим();
	Если Не Был Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	Попытка
		Выборка = OData4_Хранилище.ВыполнитьЗапрос(Запрос).Выбрать();
	Исключение
		Если Не Был Тогда
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли;
		ВызватьИсключение;
	КонецПопытки;
	Если Не Был Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	Если Не Выборка.Следующий() Или Выборка.Срок < ТекущаяУниверсальнаяДата() Тогда
		Возврат Неопределено;
	КонецЕсли;
	Если Выборка.Отпечаток <> Повтор.Отпечаток Тогда
		Отказ(Повтор.Заголовок, 422, "UnprocessableEntity", "Значение " + Повтор.Заголовок
			+ " уже использовано для другого запроса (метод, адрес или тело отличаются)");
	КонецЕсли;
	Возврат Новый Структура("Статус, Заголовки, Тело", Выборка.Статус, Выборка.Заголовки, Выборка.Тело);
КонецФункции

// Запоминает успешный ответ повторяемого запроса (в транзакции записи): статус, заголовки и тело.
Процедура Запомнить(Повтор, Ответ) Экспорт
	Если Ответ.КодСостояния >= 300 Тогда
		Возврат;
	КонецЕсли;
	Заголовки = Новый Соответствие;
	Для Каждого КлючИЗначение Из Ответ.Заголовки Цикл
		Заголовки.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку();
	ЗаписатьJSON(Запись, Заголовки);
	Данные = Ответ.ПолучитьТелоКакДвоичныеДанные();
	Сейчас = ТекущаяУниверсальнаяДата();
	Набор = РегистрыСведений.OData4_ПовторыЗапросов.СоздатьНаборЗаписей();
	Набор.Отбор.Субъект.Установить(Повтор.Субъект);
	Набор.Отбор.Ключ.Установить(Повтор.Ключ);
	Строка0 = Набор.Добавить();
	Строка0.Субъект = Повтор.Субъект;
	Строка0.Ключ = Повтор.Ключ;
	Строка0.Отпечаток = Повтор.Отпечаток;
	Строка0.Метод = Повтор.Метод;
	Строка0.Путь = OData4_Безопасность.УбратьСекреты(Повтор.Путь);
	Строка0.Статус = Ответ.КодСостояния;
	Строка0.Заголовки = Запись.Закрыть();
	Строка0.Тело = ?(Данные = Неопределено Или Данные.Размер() = 0, "", ПолучитьСтрокуИзДвоичныхДанных(Данные, "UTF-8"));
	Строка0.Записан = Сейчас;
	Строка0.Срок = Сейчас + Повтор.Часов * 3600;
	// Техническая запись хранилища OData4: без обработчиков и контроля удаляемых объектов БСП (см.
	// OData4_Безопасность.ОтключитьКонтрольУдаляемых).
	Набор.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
	Набор.ОбменДанными.Загрузка = Истина;
	Был = ПривилегированныйРежим();
	Если Не Был Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	Попытка
		Набор.Записать();
	Исключение
		Если Не Был Тогда
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли;
		ВызватьИсключение;
	КонецПопытки;
	Если Не Был Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
КонецПроцедуры

// Ответ из сохранённого (Начать): тот же статус, заголовки и тело.
Функция СохранённыйОтвет(Сохранённый) Экспорт
	Ответ = Новый HTTPСервисОтвет(Сохранённый.Статус);
	Если Сохранённый.Заголовки <> "" Тогда
		Чтение = Новый ЧтениеJSON;
		Чтение.УстановитьСтроку(Сохранённый.Заголовки);
		Заголовки = ПрочитатьJSON(Чтение, Истина);
		Для Каждого КлючИЗначение Из Заголовки Цикл
			Ответ.Заголовки.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
		КонецЦикла;
	КонецЕсли;
	Если Сохранённый.Тело <> "" Тогда
		Ответ.УстановитьТелоИзСтроки(Сохранённый.Тело, "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);
	КонецЕсли;
	Возврат Ответ;
КонецФункции

// Заголовок ответа повторяемого запроса: Repeatability-Result: accepted (OData 4.01) — и у первого ответа, и у повтора.
Процедура ОтметитьОтвет(Повтор, Ответ) Экспорт
	Если Повтор.Заголовок = "Repeatability-Request-ID" Тогда
		Ответ.Заголовки.Вставить("Repeatability-Result", "accepted");
	КонецЕсли;
КонецПроцедуры

// Удаляет записи повторяемых запросов с истёкшим сроком хранения (регламентное задание OData4_Очистка). Возвращает
// число записей.
Функция Очистить() Экспорт
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	П.Субъект КАК Субъект,
		|	П.Ключ КАК Ключ
		|ИЗ
		|	РегистрСведений.OData4_ПовторыЗапросов КАК П
		|ГДЕ
		|	П.Срок < &Сейчас");
	Запрос.УстановитьПараметр("Сейчас", ТекущаяУниверсальнаяДата());
	Строки = OData4_Хранилище.ВыполнитьЗапрос(Запрос).Выгрузить();
	Удалено = 0;
	Для Каждого Строка0 Из Строки Цикл
		Набор = РегистрыСведений.OData4_ПовторыЗапросов.СоздатьНаборЗаписей();
		Набор.Отбор.Субъект.Установить(Строка0.Субъект);
		Набор.Отбор.Ключ.Установить(Строка0.Ключ);
		Набор.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
		Набор.Записать();
		Удалено = Удалено + 1;
	КонецЦикла;
	Возврат Удалено;
КонецФункции

// Дата UTC из значения HTTP-date (RFC 7231, IMF-fixdate: «Sun, 06 Nov 1994 08:49:37 GMT») или Неопределено.
Функция ДатаHTTP(Текст) Экспорт
	Части = СтрРазделить(СокрЛП(Текст), " ", Ложь);
	Если Части.Количество() <> 6 Или ВРег(Части[5]) <> "GMT" Тогда
		Возврат Неопределено;
	КонецЕсли;
	НомерМесяца = СтрРазделить("jan,feb,mar,apr,may,jun,jul,aug,sep,oct,nov,dec", ",").Найти(НРег(Части[2]));
	Время = СтрРазделить(Части[4], ":");
	Если НомерМесяца = Неопределено Или Время.Количество() <> 3 Или Не ЭтоЦифры(Части[1], 2) Или Не ЭтоЦифры(Части[3], 4)
		Или Не ЭтоЦифры(Время[0], 2) Или Не ЭтоЦифры(Время[1], 2) Или Не ЭтоЦифры(Время[2], 2) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Попытка
		Возврат Дата(Число(Части[3]), НомерМесяца + 1, Число(Части[1]), Число(Время[0]), Число(Время[1]), Число(Время[2]));
	Исключение
		Возврат Неопределено;
	КонецПопытки;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Отказ повторяемого запроса: Repeatability-Result: rejected (у Repeatability-Request-ID) и ответ OData об ошибке.
Процедура Отказ(Заголовок, Статус, Код, Текст)
	Если Заголовок = "Repeatability-Request-ID" Тогда
		OData4_БезопасностьВызов.Контекст().ЗаголовкиОтвета.Вставить("Repeatability-Result", "rejected");
	КонецЕсли;
	OData4_Сервис.ОшибкаOData(Статус, Код, Текст);
КонецПроцедуры

// Срок хранения ответов, часы: настройка СрокПовторовЗапросов (пусто или 0 — 24).
Функция СрокЧасов()
	Часов = OData4_НастройкиСервиса.Значение("СрокПовторовЗапросов", 24);
	Возврат ?(ТипЗнч(Часов) = Тип("Число") И Часов > 0, Часов, 24);
КонецФункции

// SHA-256 строки в UTF-8: 64 строчные шестнадцатеричные цифры (как OData4_Профили.ХешТокена).
Функция Хеш(Текст)
	Хеширование = Новый ХешированиеДанных(ХешФункция.SHA256);
	Хеширование.Добавить(Текст);
	Возврат НРег(СтрЗаменить(Строка(Хеширование.ХешСумма), " ", ""));
КонецФункции

// Текст — ровно Длина цифр.
Функция ЭтоЦифры(Текст, Длина)
	Если СтрДлина(Текст) <> Длина Тогда
		Возврат Ложь;
	КонецЕсли;
	Для Позиция = 1 По Длина Цикл
		Если СтрНайти("0123456789", Сред(Текст, Позиция, 1)) = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	Возврат Истина;
КонецФункции

#КонецОбласти
